from django.conf import settings

START_TEXT = """
Привет! Это гид по Челнам от @huntersmediaa ✌🏻

Здесь можно: 
🔗 выбрать, куда сходить — на завтрак, ужин, свидание или просто прогуляться 
🔗 найти новые места и посмотреть их соцсети 
🔗 подсмотреть идеи для досуга на любой вкус

Бот пока что работает в техническом режиме — мы тестируем, обновляем и добавляем категории. Рассказывайте друзьям, чтобы как можно больше людей узнали, чем живут Челны 🫶🏻

Хотите добавить своё заведение или предложить идею? Пишите: @huntersadmins
"""

TARGET_CHAT_ID = settings.TARGET_CHAT_ID

ADMIN_ID = settings.ADMIN_ID

SUBSCRIBE_TEXT = """
Наш бот — полностью бесплатный! 🎉
Но для его использования нужно быть подписанным на наш канал @huntersmediaa 💜

Что у нас в канале?
🔹 Жизнь молодёжи Набережных Челнов — самые крутые тусовки, события и активности
🔹 Анонсы мероприятий, которые нельзя пропустить
🔹 Контент, который вдохновляет и объединяет

Подпишись здесь → t.me/huntersmediaa

После подписки возвращайся в бот и жми «Проверить подписку» — и можно начинать пользоваться! ✅

Важно: если отпишешься от канала — доступ к боту временно приостановится. Но ты всегда можешь вернуться! 😉
"""

SUPPORT_TEXT = """
Если есть вопросы или пожелания, напишите нам в @huntersadmins
"""

RECOMMEND_TEXT = """
Хочешь предложить место в бот?
Напиши сообщение в следующем формате:

1. Название категории, в которую нужно добавить место
2. Название места
3. Комментарий: почему это место стоит добавить (по желанию)
4. Ссылки на соцсети этого места (по наличию)
"""

HOW_TO_TEXT = "Если хотите разместить вашу локацию в нашем боте - напишите @huntersadmins"